Revit 2027 API
LoadCaseCategory Enumeration
 Specifies load case category.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum LoadCaseCategory
Public Enumeration LoadCaseCategory
public enum class LoadCaseCategory
type LoadCaseCategory
Members
Member name | Value | Description
Accidental | 5 |  Accidental
Dead | 0 |  Dead
Live | 1 |  Live
RoofLive | 4 |  Roof Live
Seismic | 7 |  Seismic
Snow | 3 |  Snow
Temperature | 6 |  Temperature
Wind | 2 |  Wind
See Also
Reference
Autodesk.Revit.DB.Structure Namespace